Pedulidiri/app/Models/LoginModel.php

SELECT *
FROM `user`
WHERE `nik` = '101112'
AND `password` = 'reynklvr'
---
        public function cekLogin($nik, $password)
        {
            return $this->db->table('user')->where(
            array(
            'nik' => $nik,
            'password' => $password
            )
            )->get()->getRowArray();